
beiying = """
我与父亲不相见已二年余了，我最不能忘记的是他的背影 。

那年冬天，祖母死了，父亲的差使也交卸了，正是祸不单行的日子。我从北京到徐州打算跟着父亲奔丧回家。

到徐州见着父亲，看见满院狼藉的东西，又想起祖母，不禁簌簌地流下眼泪。父亲说：“事已如此，不必难过，好在天无绝人之路！”

回家变卖典质，父亲还了亏空；又借钱办了丧事。这些日子，家中光景很是惨淡，一半因为丧事，一半因为父亲赋闲。丧事完毕，父亲要到南京谋事，我也要回北京念书，我们便同行。

到南京时，有朋友约去游逛，勾留了一日；第二日上午便须渡江到浦口，下午上车北去。父亲因为事忙，本已说定不送我，叫旅馆里一个熟识的茶房陪我同去。

他再三嘱咐茶房，甚是仔细。但他终于不放心，怕茶房不妥帖；颇踌躇了一会。其实我那年已二十岁，北京已来往过两三次，是没有什么要紧的了。

他踌躇了一会，终于决定还是自己送我去。我再三劝他不必去；他只说：“不要紧，他们去不好！”

我们过了江，进了车站。我买票，他忙着照看行李。行李太多了，得向脚夫行些小费才可过去。他便又忙着和他们讲价钱。我那时真是聪明过分，总觉他说话不大漂亮，非自己插嘴不可，但他终于讲定了价钱；就送我上车。

他给我拣定了靠车门的一张椅子；我将他给我做的紫毛大衣铺好座位。他嘱我路上小心，夜里要警醒些，不要受凉。又嘱托茶房好好照应我。

我心里暗笑他的迂；他们只认得钱，托他们只是白托！而且我这样大年纪的人，难道还不能料理自己么？唉，我现在想想，那时真是太聪明了！

我说道：“爸爸，你走吧。”他往车外看了看说：“我买几个橘子去。你就在此地，不要走动。”我看那边月台的栅栏外有几个卖东西的等着顾客。走到那边月台，须穿过铁道，须跳下去又爬上去。父亲是一个胖子，走过去自然要费事些。

我本来要去的，他不肯，只好让他去。我看见他戴着黑布小帽，穿着黑布大马褂，深青布棉袍，蹒跚地走到铁道边，慢慢探身下去，尚不大难。可是他穿过铁道，要爬上那边月台，就不容易了。

他用两手攀着上面，两脚再向上缩；他肥胖的身子向左微倾，显出努力的样子，这时我看见他的背影，我的泪很快地流下来了。我赶紧拭干了泪。怕他看见，也怕别人看见。我再向外看时，他已抱了朱红的桔子往回走了。

过铁道时，他先将桔子散放在地上，自己慢慢爬下，再抱起桔子走。到这边时，我赶紧去搀他。他和我走到车上，将桔子一股脑儿放在我的皮大衣上。于是扑扑衣上的泥土，心里很轻松似的。

过一会儿说：“我走了，到那边来信！”我望着他走出去。他走了几步，回过头看见我，说：“进去吧，里边没人。”等他的背影混入来来往往的人里，再找不着了，我便进来坐下，我的眼泪又来了。

近几年来，父亲和我都是东奔西走，家中光景是一日不如一日。他少年出外谋生，独立支持，做了许多大事。哪知老境却如此颓唐！他触目伤怀，自然情不能自已。

情郁于中，自然要发之于外；家庭琐屑便往往触他之怒。他待我渐渐不同往日。但最近两年不见，他终于忘却我的不好，只是惦记着我，惦记着我的儿子。

我北来后，他写了一信给我，信中说道：“我身体平安，惟膀子疼痛厉害，举箸提笔，诸多不便，大约大去之期不远矣。”

"""
xiangzi="""

一


祥子是个车夫，生活的奔头就是能拉上自己的车。他的日子就像一个个浪头，有车就是起了浪花，就是春风得意马蹄疾。车被大兵抢了，钱被侦探讹了，人被虎妞骗了，就是浪头落了，就是风水轮流转。祥子遭遇一个个坎，难过的熬过去，生闷气就喊一声“凭什么”。


把祥子扔进二十年代的中国，他不过是众多劳苦百姓中的一个缩影，过日子得弯着腰，弓着背，像骆驼一样伏着走。这一代人命运的悲剧被笼统地归咎于旧社会的压迫，吃了亏受了苦，多半往自个的肚里吞咽。有的人忍忍过过也就是相安无事的一辈子。有的人受得住气，吃得了亏，却难耐在大悲痛中的刺激，变了人性。这些人中，就有祥子。


你得知道，老舍的巧妙之处，就在于他并没有把祥子的悲剧全都推卸给社会的黑暗，而是体己地从祥子出发，描述他与社会的交流。在这种交流中，老舍让祥子做出自己的选择。你看故事走到一半时，祥子刚被侦探讹了钱，曹先生一家为躲难举家搬到左先生那儿住，留祥子一个人守家。祥子一人怕，跳墙到老程家躺下。他辗转着睡不着，脑子满想着关于“偷”的事情。


那时，祥子是这么算计的：院中又没人，何不去拿件东西呢。自己那么不容易剩下的几个钱，被人抢去，为曹家的事而被人抢去，为什么不可以去偷那些东西。为曹家的事而被人抢去，再由曹家赔上，不是正合适么。这么一想，他眼睛登时岑亮起来，也忘了寒冬腊月的冷。此刻的祥子，还欠些匪气，歪念头也只敢在脑子里打转，手脚倒是灵便不起来。半夜还窝囊地把老程拉扯吵醒，以做贼心虚的口气要老程作证自己的一贫如洗。


要是歪念头的种子埋下了，有了土壤有了肥料能够开花结果也不会是难事。此前的祥子，在老舍笔下是个忠耿老实的人，骨子里有股单纯劲，没朋友倾诉，没长辈依靠，他说自己以前觉得人活在一辈子一个人就行了。十八岁时，祥子没了爹妈没了家产，孑然来北京闯荡，独个儿成长。他就像一个人在走道里摸索，眼光看不远看不开，就盯着钱，而且这钱定得揣在怀里才够安心。你很难想象，这么个还没开化的人，后来，会成为巡警眼中的“头等”刺头。

二


老舍将祥子前后变化的对比，以高倍的镜头放大，呈现在读者眼前的就是反差甚远的两幅祥子的画像。正是这种对比，弱化了社会因素，强化了祥子本身与世界博弈时的挣扎。这让读者不会去一味的批判入世，而是思考这样一个问“是我们去改变世界，还是世界改变了我们”。


年轻时，祥子的梦就是他的整个世界。也没有什么长远的打算，结婚生子都排在买车之后，只有有了车，当上了体面的洋车夫，在车行中起码高人一等才是道理。这时，祥子的世界与他身处的二十年代在一定程度上是相间隔的。他要去改变，去改变自己的世界，不遗余力。


就像是鸡蛋碰着了石头，柔软的小世界碰上了现实的坚硬，祥子的梦就都碎了。


老舍给梦碎一个慢镜头的过程，虎妞难产死了，祥子把车买了攒钱给虎妞办丧事。和小福子相爱终究又被小福子辜负。车子几易其手，爱人分分合合，这个社会给予祥子的唯一的两样家产就都没了。而人活着总得有个盼头，此事过后，祥子的盼头便是“要让那些恶心人都死”。这就是个窝囊而又无力的盼头，他好像要企图改变这个世界，却在潜移默化中被这个世界的黑暗同化了。而做出这个选择的，正是他自己。


虎妞的丧事一完，他也就不再“体面”，也不再去争面子。吃喝嫖赌抽样样上手，借钱不还，骗钱、讹钱得心应手。他不再爱惜车子，泛蓝，刮风下雨他不出车，身上有点酸痛，一歇就是两三天，这些都是祥子以前不屑去做的事情。最难的，就是人的心变了。不消说，祥子过去不愿去欺侮谁，就算不受杨家人的待见，也不愿多与其争吵一两句。倒是后来，一次拉车，祥子遇见了刘四爷。刘四爷问祥子女子的下落，祥子说死了，也没告诉他虎妞埋在哪里就这么甩头走了。对刘四爷出了这口恶气，祥子的心又有了气息。


一个人从心底开始使坏的话，之前埋下的歪念头总该是发芽了。老舍的高明之处又在于，即便是到最后无恶不作的祥子，读者也没办法以仇视鄙夷去评判祥子。于我而言，除外对祥子的同情，更多的倒是去理解祥子。


不公平是世间多半仇恨的根源。只要一想起当初被抢走的车，他心中就觉得发堵，不由的想到，要强又怎么样呢，这世界并不因为自己要强而公道一些，凭什么把他的车白白抢去呢？也正因为有太多“凭什么”，他也才会觉得“雨下给富人，也下给穷人；下给义人，也下给不义之人。其实，雨并不公道，因为下落在一个没有公道的世界上”。积累的不满容易使人反抗，重则是起义革命，轻者就如祥子这般窝囊的自贱自欺。而存在于这两者之间的就是平凡的大多数，规规矩矩安安稳稳地了却一辈子。

三


老舍把二十年代的社会描写得太绝望，像是一个氢气球，腾空而升，你觉得它轻盈柔弱，向上后的命运却注定是有力的爆破。而这个爆破的高潮，在我看来，是在了小福子与祥子的纠葛上。小福子对祥子示好，而祥子面对她显得过于无能为力。祥子不是那种空口给承诺的人，他对人好，是慢慢的，默默的。他会去努力赚钱，攒钱，积蓄到足够的财产让自己能够配得上小福子，让一家子过上好日子。


而老舍在这个开了一个悲恸的玩笑，他营造出了正在升腾的希望，让读者都以为祥子所受的苦终了时都会有福报。这似乎是童话故事才有的套路，而老舍写的是现实。当祥子再见到小福子时，她已经不堪忍受生活的折磨而自绝于森林。如果说，之前对社会不公的种种抱怨，祥子都还能够忍受的话，而“情”的破灭，则突破了他生活的底线。


你别看祥子总是算计着钱财，人就显得特别抠门。其实，他对财物看得淡，车子没了，钱被抢了，他自我安慰安慰，也就过去了。他笃信的是“自己双腿都还利索，多跑几趟就又了，而且是自己赚的。”而对“情”对他来说，是无可替代的。祥子自小少受父母的关照，来北京闯，人家对他的丁点好，他都会感恩戴德。你看，他独自翻墙到老程家，祥子觉得之前在外被侦探敲诈，现在又在熟人家安稳着，有种难掩的感动，而老程也显得特别可爱。


要说祥子对虎妞有情么？其实，是有的。但是祥子对虎妞的情中有种自在的鄙夷感。虎妞太过主动，强悍，在祥子看来，并不是他所设想的爱情的样子。和虎妞结婚，祥子觉得就这么凑活过一辈子，也还可以。前文中我有提及，祥子看不远也看不开，眼前利益抓得紧。和虎妞结婚，他觉得能够过上想要的生活，有了也好，没有自己也能够再有。虎妞与其说是妻子，不如说也是祥子一辆车子，一辆没什么人想要的破车，丢了再努力，还是可以赚来的。


小福子和虎妞不同，祥子把小福子当作是“相好”。他对小福子的爱很简单，一起生活，接触后有了种患难与共的依赖。俗话说日久生情，且又是在艰难时世的日子里，相濡以沫的不就是一种爱情么。他们都是一穷二白的人，一砖一瓦的立锥之地也难得。也正因如此，祥子才会努力去赚取，此时的他，会觉得这个盼头和曾经单纯的要车是不同的，他要更幸福些。老舍将这个像火苗的盼头给掐了，写下了“他觉得过去的事情像个噩梦，使他几乎不敢再希望将来”。


这是一段叫人心酸的故事。如果小福子相安无事，他与祥子的结局也不会太差，就算小福子死了，祥子也像以前一样，哭哭骂骂就熬过去了也好。老舍这样写，许是了解过那时车夫们的生活，许是真有这样的故事发生过。毕竟，生活的状态比小说更加千奇百怪，他这样写，也算是一部分真实的还原。

四


最叫人难过的，是这个发生在二三十年代的故事，在今天依旧上演着。放开来看，祥子是每一个小人物的缩影。经典即是不同年代的读者都能够找到共鸣。我能够感触的，是一个被世界打败的弱者，一个在融入这个世界，却被这个世界排斥的小人物。而这个小人物，可能就是我们。


时下年轻人爱说的梦想就像祥子的拉车，有点意志的就会如祥子般马不停蹄地追逐。定是要走弯路，受些挫折的，就如同祥子被大兵抓，会摔跟头，会被篇被欺。好在年轻气盛，有些苦累往肚里咽就好了。放现在，祥子是个有志气有目标的年轻人，和我们一样，为有朝一日实现目标而努力。


看得最感触的，是祥子不断被这个世界同化。前文以述，祥子曾是个单纯的孩子，高大的身材显得还有些莽撞。也就是从得到几匹骆驼开始，祥子被叫成了“骆驼祥子”。骆驼，是得弓着腰的祥子，弯下的脊梁就不再那么顶天立地。也就是从这时起，他慢慢被世界打磨得圆滑，他开始意识到“经验使人知道怎样应当圆滑一些，因为命只有一条啊。”而这种转变，也正是身处大四的我，需要面对的。


我最喜欢这样的祥子。


老舍这么说“他有点像一棵树，健壮，沉默，而又有生气。他有自己的打算，有些心眼，但不好向别人讲论”。在车夫里头，个人的委屈与困难是公众的话料，“车口儿”上，小茶馆中，大杂院里，每个人形容吵嚷着自己的故事，而这些故事都成为大家的财产。祥子是乡下人，口吃不如城里人那么灵便，他天生来就不多话，所以不愿学者城里人的贫嘴多舌。他的事情他知道，不和人多说，因为嘴常闲着，所以有功夫去思想，他的眼仿佛老看着自己。这才是祥子该有的样子。


“只要他的注意打定，他便随着心中所开出的那天路走；假若走不通的话，他能一两天不出一声，咬着牙，好似咬着自己的心。”这种孤独感，正是成长中，需要自己去面对的。如果我年纪再轻些看祥子，可能就只得远观祥子的苦难，轻声唏嘘而已。而有些经历后再看，老舍在故事里埋下的东西就能够慢慢品读出来。


老舍说：“愚蠢和残忍是这里的一些现象，所以愚蠢，所以残忍，却另有原因。”而这个原因，是我需要继续思考的。
"""

yueyanglou="""
    庆历四年春，滕子京谪守巴陵郡。越明年，政通人和，百废具兴。
乃重修岳阳楼，增其旧制，刻唐贤今人诗赋于其上。属予作文以记之。(具 通：俱)
　　
    予观夫巴陵胜状，在洞庭一湖。衔远山，吞长江，浩浩汤汤，横无际涯；朝晖夕阴，
气象万千。此则岳阳楼之大观也，前人之述备矣。然则北通巫峡，南极潇湘，迁客骚人，多会于此，览物之情，得无异乎？
    
　　若夫淫雨霏霏，连月不开，阴风怒号，浊浪排空；日星隐曜，山岳潜形；商旅不行，
樯倾楫摧；薄暮冥冥，虎啸猿啼。登斯楼也，则有去国怀乡，忧谗畏讥，满目萧然，感极而悲者矣。
(隐曜 一作：隐耀；淫雨 通：霪雨)

　　至若春和景明，波澜不惊，上下天光，一碧万顷；沙鸥翔集，锦鳞游泳；岸芷汀兰，
郁郁青青。而或长烟一空，皓月千里，浮光跃金，静影沉璧，渔歌互答，此乐何极！登斯楼也，
则有心旷神怡，宠辱偕忘，把酒临风，其喜洋洋者矣。

　　嗟夫！予尝求古仁人之心，或异二者之为，何哉？不以物喜，不以己悲；居庙堂之高则忧其民；
处江湖之远则忧其君。是进亦忧，退亦忧。然则何时而乐耶？其必曰：“先天下之忧而忧，后天下之乐而乐”乎。
噫！微斯人，吾谁与归？

　　时六年九月十五日。
"""

tengwangge="""
豫章故郡，洪都新府。星分翼轸，地接衡庐。襟三江而带五湖，控蛮荆而引瓯越。物华天宝，龙光射牛斗之墟；人杰地灵，徐孺下陈蕃之榻。雄州雾列，俊采星驰。台隍枕夷夏之交，宾主尽东南之美。都督阎公之雅望，棨戟遥临；宇文新州之懿范，襜帷暂驻。十旬休假，胜友如云；千里逢迎，高朋满座。腾蛟起凤，孟学士之词宗；紫电青霜，王将军之武库。家君作宰，路出名区；童子何知，躬逢胜饯。

时维九月，序属三秋。潦水尽而寒潭清，烟光凝而暮山紫。俨骖騑于上路，访风景于崇阿；临帝子之长洲，得天人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。

披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。闾阎扑地，钟鸣鼎食之家；舸舰弥津，青雀黄龙之舳。云销雨霁，彩彻区明。落霞与孤鹜齐飞，秋水共长天一色。渔舟唱晚，响穷彭蠡之滨；雁阵惊寒，声断衡阳之浦。

遥襟甫畅，逸兴遄飞。爽籁发而清风生，纤歌凝而白云遏。睢园绿竹，气凌彭泽之樽；邺水朱华，光照临川之笔。四美具，二难并。穷睇眄于中天，极娱游于暇日。天高地迥，觉宇宙之无穷；兴尽悲来，识盈虚之有数。望长安于日下，目吴会于云间。地势极而南溟深，天柱高而北辰远。关山难越，谁悲失路之人？萍水相逢，尽是他乡之客。怀帝阍而不见，奉宣室以何年？

嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？所赖君子见机，达人知命。老当益壮，宁移白首之心？穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙以犹欢。北海虽赊，扶摇可接；东隅已逝，桑榆非晚。孟尝高洁，空余报国之情；阮籍猖狂，岂效穷途之哭！

勃，三尺微命，一介书生。无路请缨，等终军之弱冠；有怀投笔，慕宗悫之长风。舍簪笏于百龄，奉晨昏于万里。非谢家之宝树，接孟氏之芳邻。他日趋庭，叨陪鲤对；今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜；钟期既遇，奏流水以何惭？

呜乎！胜地不常，盛筵难再；兰亭已矣，梓泽丘墟。临别赠言，幸承恩于伟饯；登高作赋，是所望于群公。敢竭鄙怀，恭疏短引；一言均赋，四韵俱成。请洒潘江，各倾陆海云尔：

滕王高阁临江渚，佩玉鸣鸾罢歌舞。

画栋朝飞南浦云，珠帘暮卷西山雨。

闲云潭影日悠悠，物换星移几度秋。

阁中帝子今何在？槛外长江空自流。
"""

xiakexing = """
赵客缦胡缨，吴钩霜雪明。
银鞍照白马，飒沓如流星。
十步杀一人，千里不留行。
事了拂衣去，深藏身与名。
闲过信陵饮，脱剑膝前横。
将炙啖朱亥，持觞劝侯嬴。
三杯吐然诺，五岳倒为轻。
眼花耳热后，意气素霓生。
救赵挥金槌，邯郸先震惊。
千秋二壮士，烜赫大梁城。
纵死侠骨香，不惭世上英。
谁能书阁下，白首太玄经。
"""